models/deepseek-v2-lite-lmcmp-1p2d/benchmark_results/p95_stress_20260326_010346/warmup.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7eca007d7740>, trust_remote_code=False, seed=1132, num_prompts=50, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=3840, random_output_len=561, random_range_ratio=0.0, random_prefix_len=12000, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url=None, host='localhost', port=9000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/workspace/models/deepseek-v2-lite', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/workspace/benchmark_results/p95_stress_20260326_010346', result_filename='warmup_discard.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-f1e30ad6-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=True, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 03-26 01:04:06 [datasets.py:631] Sampling input_len from [3839, 3839] and output_len from [561, 561]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 50/50 [01:13<00:00,  1.47s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     50        
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  73.50     
Total input tokens:                      791950    
Total generated tokens:                  28050     
Request throughput (req/s):              0.68      
Output token throughput (tok/s):         381.61    
Peak output token throughput (tok/s):    698.00    
Peak concurrent requests:                31.00     
Total token throughput (tok/s):          11155.90  
---------------Time to First Token----------------
Mean TTFT (ms):                          1108.78   
Median TTFT (ms):                        882.17    
P50 TTFT (ms):                           882.17    
P90 TTFT (ms):                           1817.04   
P95 TTFT (ms):                           2629.17   
P99 TTFT (ms):                           2910.30   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          43.14     
Median TPOT (ms):                        43.46     
P50 TPOT (ms):                           43.46     
P90 TPOT (ms):                           44.70     
P95 TPOT (ms):                           44.72     
P99 TPOT (ms):                           44.94     
---------------Inter-token Latency----------------
Mean ITL (ms):                           43.14     
Median ITL (ms):                         40.34     
P50 ITL (ms):                            40.34     
P90 ITL (ms):                            41.53     
P95 ITL (ms):                            43.40     
P99 ITL (ms):                            211.40    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          25269.13  
Median E2EL (ms):                        25329.59  
P50 E2EL (ms):                           25329.59  
P90 E2EL (ms):                           26234.88  
P95 E2EL (ms):                           27165.25  
P99 E2EL (ms):                           27638.18  
==================================================
/usr/lib/python3.12/asyncio/events.py:88: UserWarning: Failed to generate timeline plot: Please install vllm[bench] for bench support
  self._context.run(self._callback, *self._args)